// 1) Створити функцію конструктор яка створює обєкт юзер (з даними імя, прізвище, вік, 
// також в юзера повинен бути унікальний іd номер від 1 до 10) в функції конструкторі 
// повиний бути метод виводу інформації про юзера. 
// Метод повинен бути винесений в прототип.
// ------------------------------------------------------------------------------------


// ------------------------------------------------------------------------------------
// 2) Створити методи на прототайп для оновлення ключів обєкту юзер наприклад змінити 
// імя, вік користувача. ІD не міняється
// ------------------------------------------------------------------------------------


// ------------------------------------------------------------------------------------
// 3) Створити функцію конструктор створення (прямокутника, квадрата ) в прототип 
// винести методи обчислення Площі, переметра, та визначення діагоналі.
// ------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------
// 4) Отримати від користувача значення name вивести в консоль, першу і останню літеру 
// з name у верхньому регістрі.
// ------------------------------------------------------------------------------------


// ------------------------------------------------------------------------------------
// 5) Створити функцію яка отримує стрінг, обрізає пробіли спочатку і кінця стрінгу, 
// якщо стрінг маж довжину більше 10 то відрізає все після 10 і додає 3 крапки
// ------------------------------------------------------------------------------------