// Створити форму яка отримує 2 значення ширину і висоту. Також є чекбокс еліпс. Якщо всі данні введено і чекбокс 
// чекнутий, розблоковується кнопка малювати і малюється еліпс, якщо чекбокс ненажатий то кнопка також 
// розблоковується і малюється прямокутник за заданими розмірами



// Cтворити інпут куди водиться значення і кнопку . Після введення значення ( цифрового ) і натискання на кнопку
// малються кола за допомогою svg. При натисканні на намальованне коло воно повино видалятись.

// Створити функцію яка малює коло в канвасі і розміщує в середині кола текст 


// ***Додадткове завдання, створити функцію яка отримує массив данних, колір. І виводить графік на канвасі