// 1) Створити функцію яка отримує массив і вибирає з нього всі 
// парні числа і розміщує в новому масиві. Функція повина 
// повертати массив з парними номерами.
let arrRandomNumbers = [1,3,5,4,6,9,8,20,31,33,10];





// 2) Створити цикл який 5 разів виводить prompt  запитує що купити
// і вводить це в массив.

let ResultArray = [];
for(let i=0; i<5; i++){
    let Item = prompt(`Що купити ?`);  
    ResultArray.push(Item);
}
    console.log(ResultArray);

// 3) Створити функцію яка отримує як аргумент массив і вираховує 
// середнє значення всіх чисел. ( при розрахунках вважайте що массив 
// може бути будьякої довжини переданий)




// 4) Створити функцію яка замінює в массиві =) на ;)
let smile = [':)', '=)',':)', '=)',':)', '=)'];




// 5) створити функцію яка отримує аргумент, якщо це 'last' то функція
// створює массив поміщає в нього останній елемент массиву  і видаляє
// останній елемент  массиву animals, якщо аргумент 'first' то також 
// записує перший елемент массиву до нового массиву і видаляє перший 
// елемент з animals
let animals =['cat', 'cow', 'fish', 'chicken', 'dog', 'pig'];





// 6) Напишіть функцію яка отримує массив і повертає сумму всіх значень 
// массиву






// 7)Створити функцію яка отримує в аргумент старт значення і фініш значення 
// ( старт менше фініша) також отрмує массив задовільної довжини. Функція 
// повина повертати массив в якому вирізанні значення з старт індекса по 
// фініш




