// - отримати від користувача назву трарини і за допогомою світч вивести звук який вона видає . Наприклад корова: му-му  і т.д

let animal = prompt('введіть тварину');
  switch (animal) {
    case "корова":
      alert(`му-му`);
      break;
    case "собака":
      alert(`гав-гав`);
      break;
    case "кіт":
      alert(`мяу-мяу`);
      break;
    case "папуга":
      alert('ви хто такі я вас не звав');
      break;
    case "свиня":
      alert('хрю-хрю');
      break;
    case "ворона":
      alert('кар-кар');
      break;
    case "змія":
      alert('всі твої гроші то наші гроші, а мої - то мої');
      break;
    default:
      alert('цю тварину ми ще не розтинали');
  }