// ---------------------------------------------------------------
// - за допомогою циклу вивести в консоль всі парні значення числа 
// ---------------------------------------------------------------
let UserNumber = parseFloat(prompt(`Введіть число до якого буде обчислено всі парні значення`, 20));
let CheckNumber = 0;

    console.log(`Ваше введене число для визначення парних перед ним ${UserNumber}`);
while(UserNumber > CheckNumber){
    CheckNumber +=2;
    if (CheckNumber>UserNumber){
        break;
    }
    console.log(`Перелік цілих парних чисел до введеного: ${CheckNumber}`);
}
// ----------------------------------------------------------------------
// - використовуючи цикл виведіть суму чисел між  А і В з умовою що A < B
// ----------------------------------------------------------------------

let NumberA = parseFloat (prompt(`введіть число A`));
let NumberB = parseFloat (prompt(`введіть число B що більше числа A`));

if (NumberA < NumberB){
    let SumaResult = 0;
    for(let i=NumberA; i<=NumberB; i++){
       SumaResult = SumaResult + i;
    }
    console.log(`Сума чисел між введеними ${SumaResult}`);
}
else {
    console.log(`Нажаль введене число B >= A`);
}
// ------------------------------------------------------------------
// - зробити цикл який виводить дані навпаки від більшого до меншого
// -------------------------------------------------------------------

for(let i=parseFloat(prompt(`Введіть значення "i" для зворотнього виводу`)); i>=0; i--){
    console.log(`зворотній порядок від числа i до нуля ${i}`);
}