// Отримати від користувача число яке більше 0 і якщо воно більше 100 то порахувати знижку 3%
// і вивести значення якщо більше 3000 то порахувати знижку 5% і якщо більше 10000 то порахувати
// знижку 7% в усіх інших випадках вивести: "У вас нема знижки до сплати число яке було введене"


let price = parseFloat(prompt("Сума покупки", 0));
if (price > 100 && price < 3000) {
  sale = (price / 100) * 3;
  result = price - sale;
  alert(`Ваша знижкa 3% до сплати ${result}`);
}
else if (price > 3000 && price < 10000) {
    sale = (price / 100) * 5;
    result = price - sale;
    alert(`Ваша знижкa 5% до сплати ${result}`);
}
else if (price > 10000 ) {
    sale = (price / 100) * 7;
    result = price - sale;
    alert(`Ваша знижкa 7% до сплати ${result}`);
}
else {
  alert(`У вас нема знижки до сплати ${price}`);
}